Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeIncompatUnConnError Property
 The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type either has no material or has badly configured dimensions, resulting in bad geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartCannotChangeTypeIncompatUnConnError { get; }
Public Shared ReadOnly Property FabricationPartCannotChangeTypeIncompatUnConnError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartCannotChangeTypeIncompatUnConnError {
	FailureDefinitionId^ get ();
}
static member FabricationPartCannotChangeTypeIncompatUnConnError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace